
# Задача 5. Товарене на багажи
# Напишете програма, която ви помага при товаренето на куфари в багажника на самолет. Всеки самолет има
# определен капацитет на багажника. До получаване на команда "End" ще получавате обем на куфар. Обемът
# на всеки трети куфар трябва да се увеличава с 10%, поради загубата на пространство при начина на
# подреждане. Ако свободното пространството в даден момент е по-малко от обема на куфар товаренето
# трябва да прекъсне.
# Вход
# Първоначално се чете един ред:
# * Капацитетът на багажника – реално число в диапазона [100.0…6000.0]
# След това до получаване на команда "End" или до запълване на багажника, се чете по един ред:
# o Обем на куфар – реално число в диапазона [100.0…6000.0]
# Изход
# На конзолата да се отпечатат следните редове според случая:
# * При получаване на командата "End" се печата:
# "Congratulations! All suitcases are loaded!"
# * Ако обемът на куфара е по-голям от оставащото пространство в багажника:
# "No more space!"
# * Накрая винаги се отпечатва статистика – колко багажа са натоварени:
# "Statistic: {брой натоварени багажи} suitcases loaded."


trunk_volume = float(input())

suitcase = input()
count = 0

while True:
    if not suitcase.isalpha():
        suitcase_vol = float(suitcase)

        if (count+1) % 3 == 0:
            suitcase_vol += suitcase_vol * 0.1

        trunk_volume -= suitcase_vol
        if trunk_volume < 0:
            print("No more space!")
            break
        count += 1
    else:
        if suitcase == "End":
            print("Congratulations! All suitcases are loaded!")
            break
    suitcase = input()
print(f"Statistic: {count} suitcases loaded.")