
# Лица на фигури
# Да се напише програма, в която потребителят въвежда вида и размерите на геометрична фигура и пресмята лицето й.
# Фигурите са четири вида: квадрат (square), правоъгълник (rectangle), кръг (circle) и триъгълник (triangle).
# На първия ред на входа се чете вида на фигурата (square, rectangle, circle или triangle):
# Ако фигурата е квадрат, на следващия ред се чете едно число - дължина на страната му;
# Ако фигурата е правоъгълник, на следващите два реда четат две числа - дължините на страните му;
# Ако фигурата е кръг, на следващия ред чете едно число - радиусът на кръга;
# Ако фигурата е триъгълник, на следващите два реда четат две числа - дължината на страната му и дължината на
# височината към нея.
# Резултатът да се закръгли до 3 цифри след десетичната точка.

from math import pi

shape = input()

if shape == "square":
    side = float(input())
    area = side * side
elif  shape == "rectangle":
    a = float(input())
    b = float(input())
    area = a * b
elif shape == "circle":
    radius = float(input())
    area = pi * (radius * radius)
elif shape == "triangle":
    b = float(input())
    h = float(input())
    area = 0.5*(b*h)

print(f"{area:.2f}")

