# 3.	Поток от букви
# Напишете програма, която прочита скрито съобщение в поредица от символи. Те се получават по един на ред до получаване
# на командата "End". Думите се образуват от буквите в реда на четенето им. Символите, които не са латински
# букви трябва да бъдат игнорирани. Думите скрити в потока са разделени от тайна команда от
# три букви – "c", "o" и "n". При първото получаване на една от тези букви, тя се маркира като срещната,
# но не се запазва в думата. При всяко следващо нейно
# срещане се записва нормално в думата. След като са налични и трите символа от командата, се печата думата
# и интервал " ". Започва се нова дума, която по същия начин чака тайната команда, за да бъде отпечатана.
# Вход
# От конзолата се чете поредица от редове с един символ на всеки до получаване на командата "End".
# Изход
# На конзолата се печата на един ред всяка дума след тайната команда, следвана от интервал.

cmd = {"c": 0, "o": 0, "n": 0}
cmd_chars = ["c", "n", "o"]


def update_cmd(in_letter):
    if in_letter in cmd_chars and cmd[in_letter] == 0:
        cmd[in_letter] = 1


def check_word_end():
    dsum = 0
    for i in cmd_chars:
        dsum += cmd[i]
    if dsum == 3:
        return True
    else:
        return False


in_char = input()
word = ""
while in_char != "End":
    if not in_char >= "A" and in_char <= "z":
        in_char = input()
        continue

    update_cmd(in_char)
    if check_word_end():
        print("got end of word")
    # print(cmd)

    word += in_char
    in_char = input()

print(word)
