#
# * Благотворителна кампания
# В сладкарница се провежда благотворителна кампания за събиране на средства, в която могат да се включат сладкари от
# цялата страна. Първоначално прочитаме от конзолата броя на дните, в които тече кампанията и броя на сладкарите, които
# ще се включат. След това на отделни редове получаваме количеството на тортите, гофретите и палачинките, които ще бъдат
# приготвени от един сладкар за един ден. Трябва да се има предвид следния ценоразпис:
# Торта - 45 лв.
# Гофрета - 5.80 лв.
# Палачинка – 3.20 лв.
# 1/8 от крайната сума ще бъде използвана за покриване на разходите за продуктите по време на кампанията.
# Да се напише програма, която изчислява сумата, която е събрана в края на кампанията.
# Вход
# От конзолата се четат 5 реда:
# Броят на дните, в които тече кампанията – цяло число;
# Броят на сладкарите – цяло число;
# Броят на тортите – цяло число;
# Броят на гофретите – цяло число;
# Броят на палачинките – цяло число.
# Изход
# Да се отпечата на конзолата едно число:
# парите, които са събрани.
#
# Примерен вход и изход
# Вход
# 23
# 8
# 14
# 30
# 16
# Изход:
# 137687.2
#
# Изчисляваме сумата, която се изкарва на ден за всеки един от продуктите, направени от 1 сладкар:
# Торти: 14 * 45 = 630 лв.;
# Гофрети: 30 * 5.80 = 174 лв.;
# Палачинки: 16 * 3.20 = 51.20 лв.
# Обща сума за един ден: (630 + 174 + 51.20) * 8 = 6841.60 лв.
# Сума събрана от цялата кампания: 6841.60 *  23 = 157356.8лв.
# Сума след покриване на разходите: 157356.8- 1/8 от 157356.8 = 137687.2лв.

days = int(input())
chiefs = int(input())
num_cakes = int(input())
num_waffles = int(input())
num_pancakes = int(input())

cakes_price = num_cakes * 45
waffles_price = num_waffles * 5.80
pancakes_price = num_pancakes * 3.20

total_per_day = (cakes_price + waffles_price + pancakes_price) * chiefs
total = total_per_day * days
expenses = total / 8
sum = total - expenses
print(f"{sum}")
