# Задача 4. Туристически магазин
# Времето се затопля и туристи, започват да си правят разходки високо в планината, където все още сняг, като
# за целта те трябва да закупят нужната туристическа екипировка.
# Вашата задача е да напишете програма, която да изчислява, стойността на екипировката, както и дали
# определения бюджет е достатъчен или не, като се знае, че в магазина има следната промоция: Всеки трети
# продукт е на половин цена.
# Вход
# От конзолата се чете:
# • На първи ред – бюджетът - реално число в интервала [1.00… 100000.00]
# • След това поредица от два реда (до получаване на команда "Stop" или при заявка за купуване на
# продукт, чиято стойност е по-висока от наличния бюджет) :
# o Име на продукта – текст
# o Цена на продукта – реално число в интервала [1.00… 5000.00]
# Изход
# На конзолата да се отпечатат следните редове според случая:
# • При получаване на командата "Stop", на един ред:
# o "You bought {брой на закупените продукти} products for {цена на покупките} leva."
# • При заявка за покупка на продукт, чиято цена е по-висока от останалите пари, на два реда:
# o "You don't have enough money!"
# o "You need {недостигащи пари} leva!"

budget = float(input())
counter = 0
sub_total = 0

in_text = input()
product_price = float(input())
while in_text != "Stop":
    if sub_total + product_price > budget:
        print("You don't have enough money!")
        print(f"You need {abs( sub_total + product_price - budget):.2f} leva!")
        exit(0)
    counter += 1
    if counter % 3 == 0:
        product_price *= 0.5
    sub_total += product_price
    in_text = input()
    if in_text == "Stop":
        break
    product_price = float(input())
print(f"You bought {counter} products for {sub_total:.2f} leva.")
