# Билети за снукър
# С наближаването на световното първенство по снукър в театъра Крусибъл в Шефилд, Англия, феновете
# нямат търпение да се сдобият с ценните билети. Заради големия наплив от хора, организаторите ви молят да
# напишете програма за продаване на билети, като се има предвид следния ценоразпис:
#                   Четвъртфинал        Полуфинал           Финал
# Стандартен        55.50 £/бр.         75.88 £/бр.         110.10 £/бр.
# Премиум           105.20 £/бр.        125.22 £/бр.        160.66 £/бр.
# ВИП               118.90 £/бр.        300.40 £/бр.        400 £/бр.
#
# При закупуване на билет, зрителят може да избере опция, снимка с трофея, на цена 40 лири.
# При достигане на определена сума има отстъпки:
# • Над 4000 лири има 25% отстъпка и безплатни снимки с трофея (ако опцията за снимки е избрана,
# таксата от 40 лири за билет не се включва)
# • Над 2500 лири има 10% отстъпка
# При избрана опция за снимки с трофея, цената се начислява след изчисляването на отстъпките.
# Вход
# От конзолата се четат 3 реда:
# 1. Етап на първенството – текст - “Quarter final ”, “Semi final” или “Final”
# 2. Вид на билета – текст - “Standard”, “Premium” или “VIP”
# 3. Брой билети – цяло число в интервала [1 … 30]
# 4. Снимка с трофея – символ – 'Y' (да) или 'N' (не)
# Изход
# На конзолата се отпечатва 1 ред:
# • "Цената, която трябва да се заплати, форматирана до втората цифра след десетичния знак"
prices = {"Standard": {"Quarter final": 55.50, "Semi final": 75.88, "Final": 110.10},
          "Premium": {"Quarter final": 105.20, "Semi final": 125.22, "Final": 160.66},
          "VIP": {"Quarter final": 118.90, "Semi final": 300.40, "Final": 400.00}}

stage = input()
ticket_type = input()
ticket_num = int(input())
souvenir_photo = input()

souvenir_price = 0
if souvenir_photo == "Y":
    souvenir_price = 40

sub_total = prices[ticket_type][stage] * ticket_num
if sub_total > 4000:
    sub_total *= 0.75
    souvenir_price = 0
elif 2500 <= sub_total <= 4000:
    sub_total *= 0.9

sub_total += souvenir_price * ticket_num
print(f"{sub_total:.2f}")
