# Световна ранглиста по тенис
# Григор Димитров е тенисист, чиято следваща цел е изкачването в световната ранглиста по тенис за мъже.
# През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от
# позицията, на която е завършил в турнира. Има три варианта за завършване на турнир:
#   	W - ако е победител получава 2000 точки
#   	F - ако е финалист получава 1200 точки
#   	SF - ако е полуфиналист получава 720 точки
# Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири, като знаете
# с колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири и колко процента
# от турнирите е спечелил.
# Вход
# От конзолата първо се четат два реда:
#   •	Брой турнири, в които е участвал – цяло число в интервала [1…20]
#   •	Начален брой точки в ранглистата - цяло число в интервала [1...4000]
# За всеки турнир се прочита отделен ред:
#   •	Достигнат етап от турнира – текст – "W", "F" или "SF"
# Изход
# Отпечатват се три реда в следния формат:
#   •	"Final points: {брой точки след изиграните турнири}"
#   •	"Average points: {средно колко точки печели за турнир}"
#   •	"{процент спечелени турнири}%"
# Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората
# цифра след десетичния знак.

def percentage(part, whole):
    return 100 * float(part) / float(whole)


score = {"W": 2000, "F": 1200, "SF": 720}
tournaments = int(input())
wins = 0
points = int(input())
start_points = points
for tournament in range(tournaments):
    stage = input()
    if stage == "W":
        wins += 1
    points += score[stage]

print(f"Final points: {points}")
print(f"Average points: {int((points-start_points)/tournaments)}")
print(f"{percentage(wins, tournaments):.2f}%")
