# Баскетболни турнири
# Деси и отборът ѝ по баскетбол участват в турнири всеки месец, като всеки турнир се състои от определен
# брой мачове. Всеки мач има краен резултат, на базата на който се определя победителят. Отборът, вкарал
# повече точки, се смята за победител. Помогнете на Деси да направи статистика за турнирите, в които участва
# с отбора си. Като вход ще получавате имена на турнири до получаване на команда "End of tournaments". За всеки
# турнир ще получавате цяло число, което ще показва броя на мачовете, които се играят за турнир. За всеки мач ще
# получавате: на първия ред точките, които е вкарал отборът на Деси, а на втория ред - точките, които е вкарал
# противниковият отбор. След получаване на точките за всеки мач отпечатайте:
#   	Ако отборът на Деси е спечелил (т.е. точките, които е вкарал нейният отбор,
#       са повече от точките на противниковия отбор):
#           "Game {кой е номерът на мача, който са изиграли за текущия турнир} of tournament {име на турнира}:
#           win with {разликата между точките на отбора на Деси и противниковия отбор} points."
# 	    Ако отборът на Деси е загубил (т.е. точките, които е вкарал нейният отбор,
#       са по-малко от точките, които е вкарал противниковият отбор):
#           "Game {кой е номерът на мача, който са изиграли за текущия турнир} of tournament {име на турнира}:
#           lost with {разликата между точките на противниковия отбор и отбора на Деси} points."
# Няма да има случаи на равенство.
# Вход
# От конзолата се четат поредица от турнири до получаване на командата "End of tournaments":
#   •	Име на турнира – текст
#   •	За всеки турнир n на брой мача – цяло число в интервала [1…15]
#   •	За всеки мач се четат по два реда:
#           o	Точки, вкарани от отбора на Деси – цяло число в интервала от [0…150]
#           o	Точки, вкарани от противниковия отбор – цяло число в интервала от [0…150]
# Изход
# На конзолата да се отпечатат следните редове:
#   •	След всеки мач да се отпечатва дали отборът на Деси е спечелил или загубил и съответно с каква разлика.
#   •	При получаване на команда "End of tournaments" да се отпечатат два реда:
#       o	{процент спечелени мачове от всички турнири}% matches win
#       o	{процент загубени мачове от всички турнири}% matches lost
# Всички проценти трябва да са форматирани до втората цифра след десетичния знак.

def percentage(part, whole):
    return 100 * float(part) / float(whole)


tournaments_won = 0
tournaments_lost = 0

hosts_win = 0
hosts_lost = 0
hosts_score = 0
guests_score = 0
total = 0
total_win = 0
total_lost = 0

tournament_name = input()
while tournament_name != "End of tournaments":
    number_of_matches = int(input())
    for match in range(1, number_of_matches + 1):
        hosts_score = int(input())
        guests_score = int(input())
        if hosts_score > guests_score:
            print(f"Game {match} of tournament {tournament_name}: win with {hosts_score - guests_score} points.")
            total_win += 1
        else:
            print(f"Game {match} of tournament {tournament_name}: lost with {guests_score - hosts_score} points.")
            total_lost += 1
    tournament_name = input()
total = total_win + total_lost
print(f"{percentage(total_win, total):.2f}% matches win")
print(f"{percentage(total_lost, total):.2f}% matches lost")
