# 7. Футболен турнир
# Екипът на СофтУни си организира футболен турнир. Първоначално прочитаме от конзолата капацитета на
# стадиона и броят на всички фенове. След това за всеки фен се чете секторът, в който се намира. Феновете
# на първия отбор са в сектор А и Б, а на втория – В и Г. Да се напише програма, която изчислява процентите на
# феновете във всеки сектор, спрямо общия брой фенове на стадиона, както и общият процент на феновете за двата отбора,
# спрямо капацитета на стадиона. Общият брой на феновете НЕ надвишава капацитета на стадиона.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
#     1.	Капацитетът на стадиона – цяло число в интервала [1 … 10000];
#     2.	Броят на всички фенове – цяло число в интервала [1 … 10000].
# За всеки един фен, на отделен ред се прочита:
#     1.	Секторът, на който се намира – текст – "A", "B", "V" и "G".
# Изход
# Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00% и 100.00%, форматирани
# до втората цифра след десетичната запетая:
#     1.	Процентът на феновете в сектор А
#     2.	Процентът на феновете в сектор Б
#     3.	Процентът на феновете в сектор В
#     4.	Процентът на феновете в сектор Г
#     5.	Процентът на всички фенове, спрямо капацитета на стадиона.


def percentage(part, whole):
    return 100 * float(part) / float(whole)


seats = {"A": 0, "B": 0, "V": 0, "G": 0}
capacity = int(input())
fan_num = int(input())
fan_sector = ""
total_fan_percent = 0
for fan in range(0, fan_num):
    fan_sector = input()
    seats[fan_sector] += 1

for i in seats:
    print(f"{percentage(seats[i], fan_num):.2f}%")
    total_fan_percent += seats[i]

print(f"{percentage(total_fan_percent, capacity):.2f}%")
