# Напишете програма, която чете цяло число n (3 ≤ n ≤ 100), въведено от потребителя, и печата
# слънчеви очила с размер 5*n x n като в примерите:
#
# n = 4
# ********    ********
# *//////*||||*//////*
# *//////*    *//////*
# ********    ********

# n = 5
n = int(input())
if n % 2 == 0:
    conn = (n // 2) -1
else:
    conn = n // 2
n2 = n*2
print("*" * n2 + " " * n + "*" * n2)
for i in range(1, (n-2)+1):
    print("*" + "/" * (n2-2) + "*", end="")
    if i == conn:
        print("|" * n, end="")
    else:
        print(" " * n, end="")
    print("*" + "/" * (n2 - 2) + "*")
print("*" * n2 + " " * n + "*" * n2)