
# Калкулатор депозити
# Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен лихвен процент.
# Използвайте следната формула:
# сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
# Вход
# От конзолата се четат 3 реда:
# Депозирана сума – реално число;
# Срок на депозита(в месеци) – цяло число;
# Годишен лихвен процент – реално число;
# Изход
# Да се отпечата на конзолата сумата в края на срока.

deposit_sum = float(input())
deposit_months = int(input())
interest = float(input())

sum_interest = (deposit_sum*interest)/100
sum_per_month = sum_interest /12

amount = deposit_sum + (sum_per_month * deposit_months)
print (amount)