#
# * Пазар за плодове
# Мария решава да мине на диета и отива до  близкия пазар, за да купи ягоди, банани, портокали и малини. Да се напише
# програма, която пресмята колко пари са  ѝ необходими за да плати сметката, като знаете, че:
# цената на  малините е на половина по-ниска от тази на ягодите;
# цената на портокалите е с 40% по-ниска от цената на малините;
# цената на бананите е с 80% по-ниска от цената на малините.
# Вход
# От конзолата се четат 5 реда:
# Цена на ягодите в лева – реално число;
# Количество на бананите в килограми – реално число;
# Количество на портокалите в килограми – реално число;
# Количество на малините в килограми – реално число;
# Количество на ягодите в килограми – реално число.
# Изход
# Да се отпечата на конзолата едно число:
# парите, които са необходими на Мария.
# Примерен вход
# 57.5
# 10
# 3.4
# 6.5
# 1.7
#
# изход
# 400.775
#
# Обяснения
# Цена на малините за килограм: 28.75 лв.
# Цена на портокалите за килограм: 28.75 – (0.4 * 28.75) = 17.25лв.
# Цена на бананите за килограм: 28.75 – (0.8 * 28.75) = 5.75 лв.
# Сума за малините: 6.5 * 28.75 = 186.875 лв.
# Сума за портокалите: 3.4 * 17.25 = 58.65 лв.
# ￼Сума за бананите: 10 * 5.75 = 57.5 лв.
# Сума за ягодите: 1.7 * 57.5 = 97.75 лв.
# Обща сума: 186.875 + 58.65 + 57.5 + 97.75 = 400.775 лв.

strawberry_price = float(input())
bananas_qty = float(input())
oranges_qty = float(input())
raspberry_qty = float(input())
strawberry_qty = float(input())

raspberry_price = strawberry_price / 2
oranges_price = raspberry_price - (raspberry_price * 0.4)
bananas_price = raspberry_price - (raspberry_price * 0.8)

strawberry_sum = strawberry_price * strawberry_qty
raspberry_sum = raspberry_price * raspberry_qty
bananas_sum = bananas_price * bananas_qty
oranges_sum = oranges_price * oranges_qty

total = strawberry_sum + raspberry_sum + bananas_sum + oranges_sum

print(f"{total}")