# Зоомагазин
# Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и други животни.
# Една опаковка храна за кучета е на цена 2.50лв., а всяка останала, която не е за тях струва 4лв.
# Вход
# От конзолата се четат 2 реда:
# Броят на кучетата - цяло число;
# Броят на останалите животни  - цяло число.
#
# Изход
# На конзолата се отпечатва:
# "{крайната сума} lv."


dog_count = int(input())
other_count = int(input())

dog_sum = dog_count * 2.50
other_sum = other_count * 4
total_count = dog_sum + other_sum

print(f"{total_count} lv.")