
# Домашни любимци
# Марина обича да пътува. Тя има 3 домашни любимеца (куче, котка и костенурка). Когато заминава на пътешествие трябва
# да съобрази колко храна да им остави, за да не останат гладни. Напишете програма, която пресмята колко килограма
# храна ще изядат всички за времето, в което Марина отсъства и дали оставената храна от нея ще им е достатъчна.
# Всяко животно изяжда определено количество храна на ден.
# Вход
# От конзолата се четат пет реда:
# Първи ред – брой дни – цяло число в интервал [1…5000]
# Втори ред – оставена храна в килограми – цяло число в интервал [0…100000]
# Трети ред – храна на ден за кучето в килограми – реално число в интервал [0.00…100.00]
# Четвърти ред – храна на ден за котката в килограми– реално число в интервал [0.00…100.00]
# Пети ред – храна на ден за костенурката в грамове – реално число в интервал [0.00…10000.00]
# Изход
# На конзолата трябва да се отпечата на един ред:
# Ако оставената храна Е достатъчна:
# "{килограма остатък} kilos of food left."
# Резултатът трябва да е закръглен към по-ниското цяло число
# Ако оставената храна НЕ Е достатъчна:
# “{килограма недостигат} more kilos of food are needed.”
# Резултатът трябва да е закръглен към по-високото цяло число

import math

days = int(input())
food_kg = int(input())
dog_food_kg = float(input())
cat_food_kg = float(input())
tutrtle_food_g = float(input())



food_per_day = (dog_food_kg * 1000) + (cat_food_kg * 1000) + tutrtle_food_g
food_total = math.ceil(food_per_day * days / 1000)

if food_total <= food_kg:
    diff = food_kg - food_total
    print(f"{diff} kilos of food left.")
else:
    diff = food_total - food_kg
    print(f"{diff} more kilos of food are needed.")
