# Футболни резултати
# Футболен отбор участва в благотворителен турнир. На този турнир отборът играе три мача като домакин. Да
# се напише програма, която изчислява колко победи, равенства и загуби има отборът по време на турнира,
# спрямо резултатите от мачовете.
# *Забележка: Отборът винаги е домакин, следователно първата цифра от резултата съответства на головете
# вкарани от него.
# Вход
# От конзолата се четат 3 реда:
# 1. Резултат от първия мач – текст
# 2. Резултат от втория мач – текст
# 3. Резултат от третия мач – текст
# Резултатите ще са в следния формат: "2:0", "0:1", "1:1" и т.н.
# /броят голове винаги ще бъде едноцифрено число/
# Изход
# На конзолата да се отпечатат три реда:
# • "Team won {брой спечелени мачове} games."
# • "Team lost {брой загубени мачове} games."
# • " Drawn games: {брой равни мачове}"

wins = 0
lost = 0
drawn = 0

for _ in range(3):
    game = input()
    hosts = int(game[0])
    guests = int(game[2])
    if guests < hosts:
        wins += 1
    elif guests > hosts:
        lost += 1
    else:
        drawn += 1
print(f"Team won {wins} games.")
print(f"Team lost {lost} games.")
print(f"Drawn games: {drawn}")

