# Фитнес център
# Напишете програма, която да изчислява броя на посетителите в един фитнес център. В началото програмата получава
# броя на посетителите на фитнеса и за всеки човек - дейността, която извършва във фитнеса. На края програмата
# трябва да отпечата броят трениращи за всяка една дейност ("Back", "Chest", 'Legs", "Abs") и броят клиенти,
# закупили продукт ("Protein shake", "Protein bar"). Също така - процентът трениращи (спрямо общия брой посетители)
# и процентът на клиентите, закупили продукт от фитнеса.
# Вход
# От конзолата се чете число, след това поредица от низове, всяко на отделен ред:
#   •	На първия ред – броят на посетителите във фитнеса – цяло число в интервала [1...1000]
#   •	За всеки един посетител на отделен ред – дейността във фитнеса – текст
#       ("Back", "Chest", "Legs", "Abs", "Protein shake" или "Protein bar")
# Изход
# Да се отпечатат на конзолата 8 реда, които съдържат следната информация:
# Ред 1 -	"{брой хора трениращи гръб} - back"
# Ред 2 -	"{брой хора трениращи гърди} - chest"
# Ред 3 -	"{брой хора трениращи крака} - legs"
# Ред 4 -	"{брой хора трениращи коремни мускули} - abs"
# Ред 5 -	"{брой хора закупили протеинов шейк} - protein shake"
# Ред 6 -	"{брой хора закупили протеинов блок} - protein bar"
# Ред 7 -	"{процент на хората дошли да тренират}% - work out"
# Ред 8 -	"{процент на хората дошли да купят протеин}% - protein"
# Всички проценти трябва да са форматирани до втората цифра след десетичния знак.

def percentage(part, whole):
    return 100 * float(part) / float(whole)


fitness = {"Back": 0, "Chest": 0, "Legs": 0, "Abs": 0, "Protein shake": 0, "Protein bar": 0}

visitors = int(input())
for i in range(visitors):
    visitor = input()
    fitness[visitor] += 1

for activity in fitness:
    print(f"{fitness[activity]} - {activity.lower()}")

protein = fitness["Protein shake"] + fitness["Protein bar"]
workout = visitors - protein
print(f"{percentage(workout, visitors):.2f}% - work out")
print(f"{percentage(protein, visitors):.2f}% - protein")
