
# Боядисване на къща
# Напишете програма, която да пресмята колко литра боя е нужна за боядисването на къщa. Като за стените се използва
# зелена боя, а за покрива – червена. Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2.
# Стените имат следните размери:
# Предната и задната стена са квадрати със страна „x“
# на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
# Страничните стени са правоъгълници със страни „x“ и „y“
# и на двете странични стени има по един квадратен прозорец със страна 1.5м
# Покривът има следните размери:
# Два правоъгълника със страни „x“ и „y“
# Два равностранни триъгълника със страна „x“ и височина „h“
# Трябва да пресметнете площта на всички страни и площта на покрива, за да
# намерите колко литра от всяка боя ще са нужни.
# ￼Вход
# От конзолата се четат 3 реда:
# x – височината на къщата – реално число в интервала [2...100]
# y – дължината на страничната стена – реално число в интервала [2...100]
# h – височината на триъгълната стена на прокрива – реално число в интервала [2...100]
# Изход
# Да се отпечатат на конзолата две числа всяко на нов ред:
# Литрите зелена боя
# Литритe червена боя
# Форматирани до вторият знак след десетичната запетая.

x = float(input())
y = float(input())
h = float(input())

window_area = 1.5 * 1.5
side_area = (x * y) - window_area
side_area *= 2

door_area = 1.2 * 2
front_side = x*x - door_area
back_side = x*x
green = front_side + back_side + side_area

front_roof = x * h / 2
front_roof *= 2
red = (x*y)*2 + front_roof

green_lt = green / 3.4
red_lt = red / 4.3

print(f"{green_lt:.2f}")
print(f"{red_lt:.2f}")
