'''
17. *Дневна печалба
Първа задача от изпита на 17 юли 2016. Тествайте решението си тук.
Иван е програмист в американска компания и работи от вкъщи средно N дни в месеца като изкарва средно
по M долара на ден. В края на годината Иван получава бонус, който е равен на 2.5 месечни заплати. От
спечеленото през годината му се удържат 25% данъци. Напишете програма, която да пресмята, колко е
чистата средна печалба на Иван на ден в лева, тъй като той харчи изкараното в България. Приема се, че в
годината има точно 365 дни. Курсът на долара спрямо лева ще се чете от конзолата.

© Software University Foundation. This work is licensed under the CC-BY- NC-SA license.
Follow us: Page 12 of 12

Вход
От конзолата се четат 3 числа:
 На първия ред – работни дни в месеца. Цяло число в интервала [5…30]
 На втория ред – изкарани пари на ден. Реално число в интервала [10.00… 2000.00]
 На третия ред – курсът на долара спрямо лева /1 долар = X лева/. Реално число в интервала [0.99…
1.99]
Изход
На конзолата да се отпечата 1 число – средната печалба на ден в лева. Резултатът да се ФОРМАТИРА до
втория знак след запетаята.
'''


working_days=int(input())
money_per_day=float(input())
usdbgn=float(input())

montly_salary = working_days * money_per_day
yearly_salary = (montly_salary * 12) + (montly_salary * 2.5)
taxes = yearly_salary / 4

yearly_income_usd = yearly_salary - taxes
yearly_income_bgn = yearly_income_usd * usdbgn
dayly_income_bgn = yearly_income_bgn/365

print("%.2f"%dayly_income_bgn)


