'''
Преди време Пешо си е купил биткойни. Сега ще ходи на екскурзия из Европа и ще му трябват евра. Освен
биткойни има и китайски юанa. Пешо иска да обмени парите си в евро за екскурзията. Напишете програма,
която да пресмята колко евра може да купи спрямо следните валутни курсове:
 1 биткойн = 1168 лева.
 1 китайски юан = 0.15 долара.
 1 долар = 1.76 лева.
 1 евро = 1.95 лева.
Обменното бюро има комисионна от 0 до 5 процента от крайната сума в евро.
Вход
От конзолата се четат 3 числа:
 На първия ред – броят биткойни. Цяло число в интервала [0…20]
 На втория ред – броят китайски юана. Реално число в интервала [0.00… 50 000.00]
 На третия ред – комисионната. Реално число в интервала [0.00 ... 5.00]
Изход
На конзолата да се отпечата 1 число - резултатът от обмяната на валутите. Не е нужно резултатът да се
закръгля.
'''

btc=int(input())
cny=float(input())
fee=float(input())

btc_in_bgn=btc*1168
cny_in_bgn=(cny*0.15)*1.76
sum_eur=(btc_in_bgn + cny_in_bgn)/1.95

fee_eur=sum_eur *(fee/100)
total=sum_eur - fee_eur

print("%.2f"%total)
