# Задача 1. Басейн
# Преподавателският екип на СофтУни организира работен ден на басейн по случай настъпването на лятото.
# Вашата задача е да напишете програма, която да изчислява каква сума трябва да се заплати. За всеки един
# човек от екипа трябва да се заплати такса вход. Трябва да имате предвид, че един чадър стига за двама
# души. Знае се, че само 75% от екипа искат шезлонги. При изчислението на броя на чадърите и шезлонгите,
# техният брой да се закръгли до по-голямото цяло число.
# Вход
# От конзолата се четат 4 числа:
# 1. Първи ред – брой на хората. Цяло число в интервала [1…100]
# 2. Втори ред – такса вход. Реално число в интервала [0.00…50.00]
# 3. Трети ред – цена един за шезлонг. Реално число в интервала [0.00…50.00]
# 4. Четвърти ред – цена за един чадър. Реално число в интервала [0.00...50.00]
# Изход
# "{сумата за покриване на разходите} lv."
# Резултатът да се форматира до втората цифра след десетичния знак.
import math

num_people = int(input())
fee = float(input())
deckchair_price = float(input())
beachumbrella_price = float(input())


total_fee = num_people * fee
umbrella_people = math.ceil(num_people / 2)
deckchair_people = math.ceil(num_people * 0.75)

total_fee += umbrella_people * beachumbrella_price + deckchair_people * deckchair_price
print(f"{total_fee:.2f} lv.")
