#  Пазаруване
# Петър иска да купи N видеокарти, M процесора и P на брой рам памет. Ако броя на видеокартите е по-голям
# от този на процесорите получава 15% отстъпка от крайната сметка. Важат следните цени:
#   •   Видеокарта – 250 лв./бр.
#   •   Процесор – 35% от цената на закупените видеокарти/бр.
#   •   Рам памет – 10% от цената на закупените видеокарти/бр.
# Да се изчисли нужната сума за закупуване на материалите и да се пресметне дали бюджета ще му стигне.
# Вход
# Входът се състои от четири реда:
#   1. Бюджетът на Петър - реално число в интервала [0.0…100000.0]
#   2. Броят видеокарти - цяло число в интервала [0…100]
#   3. Броят процесори - цяло число в интервала [0…100]
#   4. Броят рам памет - цяло число в интервала [0…100]
# Изход
# На конзолата се отпечатва 1 ред, който трябва да изглежда по следния начин:
#   •   Ако бюджета е достатъчен:
#       "You have {остатъчен бюджет} leva left!"
#   • Ако сумата надхвърля бюджета:
#       "Not enough money! You need {нужна сума} leva more!"

budget = float(input())
gpu_num = int(input())
cpu_num = int(input())
ram_num = int(input())

gpu_sum = gpu_num * 250
cpu_sum = (gpu_sum * 0.35) * cpu_num
ram_sum = (gpu_sum * 0.1) * ram_num
total = gpu_sum + cpu_sum + ram_sum

if gpu_num > cpu_num:
    total *= 0.85
left = budget - total
if left >= 0:
    print(f"You have {left:.2f} leva left!")
else:
    print(f"Not enough money! You need {abs(left):.2f} leva more!")
