# Задача 1. Великденски обяд
# Бабата на Деси всяка година приготвя обяд за семейството си за Великден. Напишете програма, която
# изчислява какви разходи ще има по приготвянето на обяда, като знаете колко броя козунаци, кори с яйца и
# килограма курабии е купила. Цените на продуктите са следните:
# • Козунак – 3.20 лв.
# • Яйца – 4.35 лв. за кора с 12 яйца
# • Курабии – 5.40 лв. за килограм
# • Боя за яйца - 0.15 лв. за яйце
# Вход
# От конзолата се четат 3 реда:
# • Брой козунаци - цяло число в интервала [0 … 99]
# • Брой кори с яйца - цяло число в интервала [0 … 99]
# • Килограми курабии - цяло число в интервала [0 … 99]
# Изход
# Да се отпечата на конзолата колко ще са разходите по приготвянето на обяда. Сумата да бъде
# форматирана до втория знак след десетичната запетая.
# URL to check: https://judge.softuni.bg/Contests/Practice/Index/1637#0

cakes = int(input())
egg_stacks = int(input())
cookies_kg = int(input())

cakes_sum = cakes * 3.20
egg_sum = egg_stacks * 4.35
cookies_sum = cookies_kg * 5.40
egg_paint_sum = round(egg_stacks*12 * 0.15, 2)

total = cakes_sum + egg_sum + egg_paint_sum + cookies_sum
print(f"{total:.2f}")
