
# Четна / нечетна сума
# Да се напише програма, която чете n-на брой цели числа, подадени от потребителя, и проверява дали сумата от числата
# на четни позиции е равна на сумата на числата на нечетни позиции. При равенство да се отпечатат два реда:
# "Yes" и на нов ред "Sum = " + сумата;
# иначе да се отпечата:
# "No" и на нов ред "Diff = " + разликата.
# Разликата се изчислява по абсолютна стойност.

n = int(input())
odd_sum = 0
even_sum = 0


for i in range(1, n+1):
    if i & 1 == 1:
        odd_sum += int(input())
    else:
        even_sum += int(input())

if odd_sum == even_sum:
    print("Yes")
    print(f"Sum = {odd_sum}")
else:
    print("No")
    print(f"Diff = {abs(even_sum - odd_sum)}")
