#  Кафемашина
# Напишете софтуер, който да пресмята сметката на клиент, закупил определен брой от дадена напитка от
# кафемашина.
#           Без захар       Нормално        Допълнително захар
# Еспресо   0.90 лв./бр.    1 лв./бр.       1.20 лв./бр.
# Капучино  1.00 лв./бр.    1.20 лв./бр.    1.60 лв./бр.
# Чай       0.50 лв./бр.    0.60 лв./бр.    0.70 лв./бр.
# Трябва да имате предвид следните отстъпки:
#   •   При избрана напитка без захар има 35% отстъпка.
#   •   При избрана напитка "Espresso" и закупени поне 5 броя, има 25% отстъпка.
#   •   При сума надвишава 15 лева, 20% отстъпка от крайната цена,
# Отстъпките се прилагат в реда на тяхното описване.
# Вход
# Входът се чете от конзолата и се състои от три реда:
#   •   Първи ред - напитка - текст с възможности"Espresso", "Cappuccino" или "Tea"
#   •   Втори ред - захар - текст с възможности "Without", "Normal" или "Extra"
#   •   Трети ред - брой напитки - цяло число в интервала [1… 50]
# Изход
# На конзолата трябва да се отпечата един ред:
#   "You bought {брой напитки} cups of {напитка} for {крайна цена} lv."
# Цената да бъде форматирана до втората цифра след десетичния знак

prices = {"Espresso": {"Without": 0.9, "Normal": 1, "Extra": 1.2},
          "Cappuccino": {"Without": 1, "Normal": 1.2, "Extra": 1.6},
          "Tea": {"Without": 0.5, "Normal": 0.6, "Extra": 0.7}}

drink = input()
sugar = input()
drink_num = int(input())

total = drink_num * prices[drink][sugar]
if sugar == "Without":
    total *= 0.65
if drink == "Espresso" and drink_num >= 5:
    total *= 0.75

if total > 15:
    total *= 0.8

print(f"You bought {drink_num} cups of {drink} for {total:.2f} lv.")
