# 5. Предизвикай Сватбата
# Провокирани от сватбата си, Михаела и Иван решават да предоставят нова услуга на клиенти на ресторанта си, а именно
# вечеря за запознанства - "Предизвикай Сватбата". Напишете програма, която отпечатва всички възможни срещи на клиентите
# на ресторанта. При настаняване всеки мъж и всяка жена получават талончета с поредни номера стартирайки от 1. Ако бъдат
# заети всички маси, програмата трябва да приключи. Всяка маса има две места.
# Вход
# От конзолата се четат точно 3 числа, всяко на отделен ред:
# • Броя клиенти мъже - цяло число в интервала [1...100]
# • Броя клиенти жени - цяло число в интервала [1...100]
# • Максималният брой маси - цяло число в интервала [1...100]
# Изход
# На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
# • ({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...


male = int(input())
female = int(input())
num_tables = int(input())
counter = 0
for male_counter in range(1, male + 1):
    for female_counter in range(1, female + 1):
        print(f"({male_counter} <-> {female_counter})", end=" ")
        counter += 1
        if counter == num_tables:
            exit(0)
