# 8. Отключване на тайната врата
# В града има тайна врата, за която всички знаят, но никой не е успявал да я отключи и да види какво има зад нея. За
# да бъде отключена трябва да се въведе трицифрен код.
# Напишете програма, която генерира комбинации спрямо въведени числа – предположения от потребителя. От конзолата се
# въвеждат три цифри. Тези цифри ще бъдат горната граница, до която ние искаме да получим всички трицифрени числа, на
# които всяка една цифра отговаря на следните условия:
# •	Цифрата на единиците и цифрата на стотиците трябва да бъде четна
# •	Цифрата на десетиците да бъде просто число в диапазона (2...7).
# Това ще са възможните комбинации според въведените предположения от потребителя, с които ще може евентуално да се
# отключи вратата.
# Вход
# От конзолата се четат 3 реда:
# •	Горната граница на стотиците - цяло число в диапазона (1-9)
# •	Горната граница на десетиците - цяло число в диапазона (1-9)
# •	Горната граница на единиците - цяло число в диапазона (1-9)
# Изход
# Да се отпечатат на конзолата всички трицифрени числа, за които всяка една част отговаря на условията по-горе.

def prime_number(n):
    if n > 1:
        for i in range(2, n):
            if (n % i) == 0:
                return False
        return True
    else:
        return False


hundreds = int(input())
dozens = int(input())
ones = int(input())


for i in range(1, hundreds + 1):
    if i % 2 == 0:
        for ii in range(1, dozens + 1):
            if prime_number(ii):
                for iii in range(1, ones + 1):
                    if iii % 2 == 0:
                        print(f"{i} {ii} {iii}")
