# 9.	Сума от две числа
# Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа. На
# изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число. Ако няма
# нито една комбинация отговаряща на условието се печата съобщение, че не е намерено.
# Вход
# Входът се чете от конзолата и се състои от три реда:
# •	Първи ред – начало на интервала – цяло число в интервала [1...999]
# •	Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
# •	Трети ред – магическото число – цяло число в интервала [1...10000]
# Изход
# На конзолата трябва да се отпечата един ред, според резултата:
# •	Ако е намерена комбинация чиито сбор на числата е равен на магическото число
# o	"Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
# •	Ако не е намерена комбинация отговаряща на условието
# o	"{броят на всички комбинации} combinations - neither equals {магическото число}"


start_interval = int(input())
end_interval = int(input())
magic_number = int(input())
counter = 0
for fist_digit in range(start_interval, end_interval+1):
    for second_digit in range(start_interval, end_interval+1):
        counter += 1
        if fist_digit + second_digit == magic_number:
            print(f"Combination N:{counter} ({fist_digit} + {second_digit} = {magic_number})")
            exit(0)
if counter >= end_interval - start_interval * 2:
    print(f"{counter} combinations - neither equals {magic_number}")
