# 11.	Паркинг "Happy Cat"
# Деси трябва да заведе котката си на ветеринар в клиниката "Happy Cat", но паркингът се заплаща. Напишете програма,
# която пресмята колко общо трябва да се плати за престоя на колата на Деси на паркинга, за да заведе котката си на
# ветеринар. Паркингът е различен от останалите и има разнообразен ценоразпис.
# За всеки четен ден и нечетен час, паркингът таксува 2.50 лева.
# Във всеки нечетен ден и четен час таксата е 1.25 лева,
# във всички останали случаи се  заплаща 1 лев.
# Таксуването става на всеки изминал час от деня. Всеки един от изходите трябва да бъде закръглен до
# втория знак след десетичната запетая.
# Вход
# От конзолата се четат два реда:
# •	Брой дни – цяло число в интервала [1 … 5]
# •	Брой часове за всеки един от дните - цяло число в интервала [1 … 24]
# Изход:
# Да се отпечата на конзолата:
# •	За всеки изминал ден, общата сума, която трябва да се
#     плати – "Day: {индексът на деня} – {общата сума за деня} leva"
# •	Когато програмата приключи - "Total: {общата сума за всички дни} leva"

def is_even(even_num):
    if even_num % 2 == 0:
        return True
    else:
        return False


num_days = int(input())
num_hours = int(input())
fee = 0
daily_total = 9
total = 0
for day in range(1, num_days+1):
    daily_total = 0
    for hour in range(1, num_hours+1):
        if is_even(day) and not is_even(hour):
            fee = 2.50
        elif (not is_even(day)) and is_even(hour):
            fee = 1.25
        else:
            fee = 1
        daily_total += fee
    print(f"Day: {day} - {daily_total:.2f} leva")
    total += daily_total
print(f"Total: {total:.2f} leva")
