# 13.	Четни двойки
# Напишете програма, която генерира и принтира на конзолата четирицифрени числа, в които първата и втората двойка цифри
# образуват двуцифрени прости числа (пример за такова число 1723). Крайната стойност до която трябва да се генерират
# двойките се определя от други 2 цифри, подадени като вход, които определят с колко крайната стойност е по-голяма
# от началната.
# Вход
# От конзолата се четат четири реда:
# •	На първия ред – началната стойност на първите първата двойка числа – цяло положително число в диапазона [10… 90]
# •	На втория ред – началната стойност на втората двойка числа – цяло положително число в диапазона [10… 90]
# •	На третия ред – разликата между началната и крайната стойност на  първата двойка числа
#     – цяло положително число в диапазона [1… 9]
# •	На четвъртия ред – разликата между началната и крайната стойност на  втората двойка числа
#     – цяло положително число в диапазона [1… 9]
# Изход:
# Да се отпечатат на конзолата четирицифрените числа, в които първите две и вторите две цифри са прости
# двуцифрени числа.


def prime_number(n):
    if n > 0:
        for i in range(2, n):
            if (n % i) == 0:
                return False
        return True
    else:
        return False

first_pair = int(input())
second_pair = int(int(input()))
first_diff = int(input())
second_diff = int(input())

for first in range(first_pair, first_pair + first_diff + 1):
    for second in range(second_pair, second_pair + second_diff + 1):
        if prime_number(first) and prime_number(second):
            print(f"{first}{second}")
