#  Храна за домашни любимци
# Ани има два домашни любимеца - куче и котка. Напишете програма, която изготвя статистика за храната на
# домашните любимци за определен брой дни. Всеки ден кучето и котката изяждат различно количество от
# общата им храна. На всеки трети ден получават награда - бисквитки. Количеството на бисквитките е 10% от
# общо изядената храна за деня.
# Вашата програма трябва да отпечатва статистика за количеството бисквитки, които са изяли, колко процента
# от първоначалното количество обща храна са изяли и колко процента от изядената храна е изяло кучето и
# колко е изяла котката.
# Вход
# Първоначално се чете един ред:
# • Брой дни – цяло число в диапазона [1…30]
# • Общо количество храна – реално число в диапазона [0.00…10000.00]
# След това за всеки ден се чете:
# o Количество изядена храна от кучето – цяло число в диапазона [10…500]
# o Количество изядена храна от котката – цяло число в диапазона [10…500]
# Изход
# На конзолата да се отпечатват четири реда:
# • "Total eaten biscuits: {количество изядени бисквитки}gr."
# • "{процент изядена храна}% of the food has been eaten."
# • "{процент изядена храна от кучето}% eaten from the dog."
# • "{процент изядена храна от котката}% eaten from the cat."
# Количеството изядени бисквитки трябва да бъде закръглено до най – близкото цяло число, а процентът
# храна трябва да бъде форматиран до втората цифра след десетичния знак.
# Обяснения:
# Имаме 3 дена и общо количество храна 1000гр.
# На първия ден:
# Кучето изяжда 300гр, котката изяжда 20гр.
# На втория ден:
# Кучето изяжда 100гр, котката изяжда 30гр.
# На третия ден:
# Кучето изяжда 110гр, котката изяжда 40гр.
# На този ден трябва да получат и награда – бисквитки:
# 10% от 110 + 40 – 15гр.
# Общо изядена храна: 600гр.
# Изядена храна от кучето: 510гр, от котката: 90гр.
# 600гр от 1000гр = 60% от храната е изядена.
# 510гр от 600гр = 85% е изяло кучето.
# 90гр от 600гр = 15% е изяла котката.
# https://judge.softuni.bg/Contests/Practice/Index/2275?fbclid=IwAR3dpVl_cdwmMHiBJAQQLy3acvK6iJJ3POPK3HFHycHwQeYyfSac5LTD24Y#6


def percentage(part, whole):
    return 100 * float(part) / float(whole)


num_days = int(input())
food_amount = float(input())
biscuits = 0
total_dog = 0
total_cat = 0
total_eaten = 0
for days in range(1, num_days + 1):
    eaten_by_dog = int(input())
    eaten_by_cat = int(input())
    total_dog += eaten_by_dog
    total_cat += eaten_by_cat
    total_eaten += eaten_by_dog + eaten_by_cat

    if days % 3 == 0:
        biscuits += (eaten_by_dog + eaten_by_cat) * 0.1

percent_eaten = percentage(total_eaten, food_amount)
dog_percent = percentage(total_dog, total_eaten)
cat_percent = percentage(total_cat, total_eaten)
biscuits_round = round(biscuits)
print(f"Total eaten biscuits: {biscuits_round}gr.")
print(f"{percent_eaten:.2f}% of the food has been eaten.")
print(f"{dog_percent:.2f}% eaten from the dog.")
print(f"{cat_percent:.2f}% eaten from the cat.")
