#
# Машина за копане
# Доналд иска да си сглоби машина за крипто добив, но преди да си купи видео картите, той трябва да изчисли за колко
# време ще си върне инвестицията. Той трябва да се съобрази с цената на тока, като иска да си закупи общо 13 видео
# карти и 13 преходника, а останалите компоненти за машината е намерил втора употреба на обща цена 1000 лева.
# Да се напише програма, която пресмята за колко време ще си върне вложените пари (закръглени до по-голямото цяло
# число) и колко пари ще трябва да инвестира първоначално.
# Вход:
# От конзолата се прочитат 4 числа:
# •	На първия ред: цена на една видео карта – цяло число в интервала [1 … 2000]
# •	На втория ред: цена на един преходник – цяло число в интервала [1 … 50]
# •	На третия ред: цена на консумирания ток от карта за един ден – реално число в интервала [0.01 ... 10.00]
# На четвъртия ред: печалба от една карта за един ден – реално число в интервала [1.00 ... 100.00]
# Изход:
# Да се отпечатат два реда на конзолата:
# •   Общо похарчените пари по машината
# •   Времето за възвръщане на инвестицията в дни (закръглени до по-голямото цяло число)
import math
gpu_price = int(input()) * 13
adapter_price = int(input()) * 13
power_price = float(input())
income_per_day = float(input()) - power_price

components_price = gpu_price + adapter_price + 1000

print(components_price)
print(math.ceil(components_price / (income_per_day * 13)))

