# Задача 3. Футболни сувенири
# На почивката между полувремената на мача Бразилия vs Германия - Пепи решава да си закупи сувенир за
# спомен от световното първенство по футбол. На щанд пред стадиона се предлагат различни стоки, като
# цените им зависят от отбора на дадената страна. Напишете програма, която изчислява сумата за закупените
# сувенири.
# Отборите и цените на стоките са както следва:
#           Аржентина           Бразилия           Хърватия          Дания
# флагчета  3.25 лв.            4.20 лв.           2.75 лв.         3.10 лв.
# шапки     7.20 лв.            8.50 лв.           6.90 лв.         6.50 лв.
# плакати   5.10 лв.            5.35 лв.           4.95 лв.         4.80 лв.
# стикери   1.25 лв.            1.20 лв.           1.10 лв.         0.90 лв.
# Вход:
# От конзолата се четат 3 реда:
#   •   Първият ред – отбор – текст с възможности: "Argentina", "Brazil", "Croatia", "Denmark"
#   •   Вторият ред – вид сувенири – текст с възможности: "flags", "caps", "posters", "stickers"
#   •   Третият ред – брой закупени сувенири – цяло число в интервала [1…200]
# Изход:
# Да се отпечата на конзолата един ред :
#   •   Ако страната и стоката са правилно зададени:
#       ''Pepi bought {брой сувенири} {вид сувенири} of {отбор} for {крайна сума} lv.''
#   •   Ако страната не е правилно зададена:
#       "Invalid country!"
#   •   Ако стоката не е правилно зададена:
#       "Invalid stock!"
# Резултатът да е форматиран до втората цифра след десетичната запетая.

prices = {   "flags": {"Argentina": 3.25, "Brazil": 4.20, "Croatia": 2.75, "Denmark": 3.10},
              "caps": {"Argentina": 7.20, "Brazil": 8.50, "Croatia": 6.90, "Denmark": 6.50},
           "posters": {"Argentina": 5.10, "Brazil": 5.35, "Croatia": 4.95, "Denmark": 4.80},
          "stickers": {"Argentina": 1.25, "Brazil": 1.20, "Croatia": 1.10, "Denmark": 0.90}}

team = input()
souvenir = input()
souvenirs_num = int(input())
if souvenir not in prices.keys():
    print("Invalid stock!")
elif team not in prices[souvenir].keys():
    print("Invalid country!")
else:
    total = souvenirs_num * prices[souvenir][team]
    print(f"Pepi bought {souvenirs_num} {souvenir} of {team} for {total:.2f} lv.")

