#
# Задача 5. Коледни подаръци
# Коледа наближава и Иван решава да купи по един подарък за всеки от семейството си. Той си прави списък с хората,
# на които иска да подари нещо. Това, какъв подарък ще купи зависи от възрастта на хората в списъка му:
# Всички до 16 (вкл.) години се считат за деца и ще получат играчка
# Всички над 16 години се считат за възрастни и ще получат коледен пуловер
# Цената на всяка играчка е 5 лв., а цената на един пуловер е 15 лв.
# Напишете програма, която пресмята колко души от семейството на Иван са до 16 (вкл.) години и колко са над
# тази възраст, също и колко пари ще струват подаръците на децата и възрастните.
# Вход:
# От конзолата се четат поредица от редове до получаване на команда "Christmas":
# Годините на всеки член от семейството - цяло число в интервала [1 … 130]
# Изход:
# Да се отпечатат на конзолата четири реда:
# "Number of adults: {брой хора над 16 години}"
# "Number of kids: {брой хора до 16 (вкл.) години}"
# "Money for toys: {сумата за всички играчки}"
# "Money for sweaters: {сума за всички пуловери}"

entry = input()
adults = 0
kids = 0
while entry != "Christmas":
    age = int(entry)
    if 0 <= age <= 16:
        kids += 1
    elif age > 16:
        adults += 1
    entry = input()

print(f"Number of adults: {adults}")
print(f"Number of kids: {kids}")
print(f"Money for toys: {kids * 5}")
print(f"Money for sweaters: {adults * 15}")
