#
# Пътници на полет
# Напишете програма, която проследява колко пътници средно на полет има всяка авиокомпания. Всеки ден има определен
# брой авиокомпании, които имат полети. До получаване на команда "Finish" получавате брой пътници на полет. Трябва да
# изчислите средния брой пътници на полет на авиокомпания. След като излетят всички полети на всички авиокомпании
# трябва да отпечатате коя е компанията с най-голям среден брой пътници за полетите си. Средният брой пътници винаги
# трябва да бъде закръглен към най-близкото цяло число надолу.
# Вход:
# Първоначално от конзолата се прочита броят на авиокомпаниите – цяло число в интервала [1… 20]
# След това за всяка авиокомпания се прочита:
#   Името на авиокомпанията – текст
#   До получаване на командата "Finish" се чете:
#       Брой пътници на полет  – цяло число в интервала [1... 360]
# Изход:
# След прочитането на всички пътници (получаване на команда "Finish") на дадена компания на конзолата се
# отпечатва един ред:
#   "{името на авиокомпанията}: {средният брой пътници на полет} passengers."
# След като излетят всички полети на всички авиокомпании се отпечатва един ред за компанията с най-голям среден
# брой пътници:
#   "{името на авиокомпанията с най-много пътници на полет} has most passengers per flight: {средният брой пътници на полет}"
import sys

companies = int(input())
passengers = 0
best_company = ""
best_company_passengers = -sys.maxsize

for company in range(companies):
    company_name = input()
    entry = input()
    num_flights = 0
    passengers = 0
    while entry != "Finish":
        passengers += int(entry)
        num_flights += 1
        entry = input()
    avg_pass = int(passengers / num_flights)
    print(f"{company_name}: {avg_pass} passengers.")
    if avg_pass > best_company_passengers:
        best_company_passengers = avg_pass
        best_company = company_name

print(f"{best_company} has most passengers per flight: {best_company_passengers}")
