
# Магазин за цветя
# Мария иска да купи подарък на сина си. Тя работи в магазин за цветя. В магазина идва поръчка за цветя. Напишете
# програма, която пресмята сумата от поръчката и дали печалбата е достатъчна за подаръка. Цветята имат следните цени:
# Магнолии    – 3.25 лева
# Зюмбюли     – 4 лева
# Рози        – 3.50 лева
# Кактуси     – 8 лева
# От общата сума, Мария трябва да плати 5% данъци.
#
# Вход
# Входът се чете от конзолата и се състои от 5 реда:
# Брой магнолии – цяло число в интервала [0 … 50]
# Брой зюмбюли – цяло число в интервала [0 … 50]
# Брой рози – цяло число в интервала [0 … 50]
# Брой кактуси – цяло число в интервала [0 … 50]
# Цена на подаръка – реално число в интервала [0.00 … 500.00]
# Изход
# На конзолата трябва да се отпечата един ред.
# Ако парите СА стигнали: "She is left with {останали} leva." – сумата трябва да е закръглена към по-малко цяло
# число (пр. 1.90 -> 1).
# Ако парите НЕ достигат: "She will have to borrow {останали} leva." – сумата трябва да е закръглена към по-голямо
# цяло число (пр. 1.10 -> 2).
import math

magnolia_num = int(input())
hyacinth_num = int(input())
rose_num = int(input())
cactus_num = int(input())
gift_price = float(input())

sub_total = (magnolia_num * 3.25) + (hyacinth_num * 4) + (rose_num * 3.50) + (cactus_num * 8)
sub_total -= sub_total * 0.95

if sub_total >= gift_price:
    diff = gift_price - sub_total
    print(f"She is left with {math.floor(diff)} leva.")
else:
    diff =  sub_total - gift_price
    print(f"She will have to borrow {math.ceil(diff)} leva.")
