# Задача 3. Мобилен оператор
# Мобилен оператор предлага договори с различна месечна такса в зависимост от срока - 1 или 2 години. Да се
# напише програма, която изчислява дължимата сума, която трябва да се плати за определен брой месеци.
#
# срок / тип      Small       Middle      Large       ExtraLarge
# 1 година(one)   9.98 лв.    18.99 лв.   25.98 лв.   35.99 лв.
# 2 години(two)   8.58 лв.    17.09 лв.   23.59 лв.   31.79 лв.
# Условия:
#
# • при добавен мобилен интернет, към таксата за един месец се добавя:
# o при такса по-малка или равна на 10.00 лв. → 5.50 лв.
# o при такса по-малка или равна на 30.00 лв. → 4.35 лв.
# o при такса по-голяма от 30.00 лв. → 3.85 лв.
# • ако договорът e за две години, общата сума се намалява с 3.75%
# Вход
# От конзолата се четат 3 реда:
# 1. Срок на договор – текст – "one", или "two"
# 2. Тип на договор – текст – "Small", "Middle", "Large"или "ExtraLarge"
# 3. Добавен мобилен интернет – текст – "yes" или "no"
# 4. Брой месеци за плащане - цяло число в интервала [1 … 24]
# Изход
# На конзолата се отпечатва 1 ред:
# • Цената, която заплаща клиентът, форматирана до втория знак след десетичната запетая, в следния
# формат: "{цената} lv."
prices = {"one": {"Small": 9.98, "Middle": 18.99, "Large": 25.98, "ExtraLarge": 35.99},
           "two": {"Small": 8.58, "Middle": 17.09, "Large": 23.59, "ExtraLarge": 31.79}}

contract_years = input()
contract_type = input()
inet_access = input()
num_months = int(input())

price = prices[contract_years][contract_type]
if inet_access == "yes":
    if price <= 10:
        price += 5.50
    elif price >= 11 and price <= 30:
        price += 4.35
    elif price > 30:
        price += 3.85

sub_total = num_months * price
if contract_years == "two":
    sub_total -= sub_total * 0.0375

print(f"{sub_total:.2f} lv.")
