# 4.	Конвертор за мерни единици
# Да се напише програма, която преобразува разстояние между следните 3 мерни единици: mm, cm, m. Използвайте
# съответствията от таблицата по-долу:
# входна единица	    изходна единица
# 1 meter (m)	1000    millimeters (mm)
# 1 meter (m)	100     centimeters (cm)
# Входните данни се състоят от три реда, въведени от потребителя:
# •	Първи ред: число за преобразуване - реално число;
# •	Втори ред: входна мерна единица – текст;
# •	Трети ред: изходна мерна единица (за резултата) – текст.
# На конзолата да се отпечата резултатът от преобразуването на мерните единици, форматиран до третия знак след
# десетичната запетая.

number = float(input())
in_unit = input()
out_unit = input()
rez = 0
if in_unit == "m":
    if out_unit == "cm":
        rez = number * 100
    else:
        rez = number * 1000
elif in_unit == "cm":
    if out_unit == "m":
        rez = number / 100
    else:
        rez = number * 10
elif in_unit == "mm":
    if out_unit == "cm":
        rez = number / 10
    else:
        rez = number  / 1000

print(f"{rez:.3f}")