# Задача 5. Великденски козунаци
# Предстои Великден и Деси е решила да изпече домашни козунаци за колегите си. Главните продукти, които ще
# трябват на Деси са: брашно и захар. Един пакет захар е 950 грама, а един пакет брашно е 750 грама. Напишете
# програма, която изчислява колко пакета захар и брашно трябва да купи Деси, за да й стигнат за направата на
# козунаците, като знаете за всеки един козунак по колко грама захар и брашно са изразходени. Също
# намерете кое е най-голямото количество захар и брашно, които са използвани.
# Вход
# От конзолата се чете 1 ред:
# • Броят на козунаците – цяло число в интервала [1 ... 100]
# За всеки козунак се чете:
# o Количество изразходвана захар (грамове) – цяло число в интервала [1 … 10000]
# o Количество изразходвано брашно (грамове) – цяло число в интервала [1 … 10000]
# Изход
# Да се отпечатат на конзолата 3 реда:
# • "Sugar: {брой нужни пакети захар}"
# • "Flour: {брой нужни пакет брашно}"
# • "Max used flour is {максимално количество грамове брашно, използвани за правенето
# на козунак} grams, max used sugar is {максимално количество грамове захар,
# използвани за правенето на козунак} grams."
# Пакетите захар и брашно да бъдат закръглени към най-близкото цяло число нагоре.
# URL to check: https://judge.softuni.bg/Contests/Practice/Index/1637#9

import math

num_bakes = int(input())
total_sugar = 0
total_flour = 0

max_sugar = 0
max_flour = 0

for bake in range(1, num_bakes+1):
    sugar = int(input())
    flour = int(input())
    total_sugar += sugar
    total_flour += flour
    if sugar > max_sugar:
        max_sugar = sugar
    if flour > max_flour:
        max_flour = flour

sugar_packets = math.ceil(total_sugar / 950)
flour_packets = math.ceil(total_flour / 750)

print(f"Sugar: {sugar_packets}")
print(f"Flour: {flour_packets}")
print(f"Max used flour is {max_flour} grams, max used sugar is {max_sugar} grams.")
